tap "homebrew/bundle"
tap "modularml/packages"
brew "zstd"
brew "bat"
brew "coreutils"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "hugo"
brew "python@3.12", link: false
brew "mise"
brew "pinentry-mac"
brew "pipx"
brew "prettier"
brew "python@3.11", link: false
brew "ripgrep"
brew "ruff", link: false
brew "yarn"
brew "zsh"
cask "gpg-suite"
cask "orbstack"
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "Atelierbram.atelier-vscode-themes"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "julialang.language-julia"
vscode "KevinRose.vsc-python-indent"
vscode "mattn.Lisp"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "ymotongpoo.licenser"
vscode "zhuangtongfa.material-theme"
