tap "charmbracelet/tap"
tap "homebrew/core"
tap "kushalpandya/tap"
tap "modularml/packages"
tap "nijaru/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "stripe/stripe-cli"
brew "age"
brew "brotli"
brew "libdeflate"
brew "zstd"
brew "openjph"
brew "openexr"
brew "webp"
brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "ncurses"
brew "ca-certificates"
brew "bat"
brew "biome"
brew "btop"
brew "cargo-instruments"
brew "certifi"
brew "chezmoi"
brew "dav1d"
brew "ffmpeg"
brew "chromaprint"
brew "clang-format"
brew "libnghttp3"
brew "libngtcp2"
brew "simdjson"
brew "sqlite", link: true
brew "uvwasi"
brew "node"
brew "cloudflare-wrangler"
brew "cmake"
brew "coreutils"
brew "rtmpdump"
brew "curl", link: true
brew "difftastic"
brew "direnv"
brew "doctl"
brew "doggo"
brew "dos2unix"
brew "duckdb"
brew "duf"
brew "dust"
brew "eigen"
brew "erlang"
brew "elixir"
brew "envoy"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fcp"
brew "fd"
brew "fish"
brew "fisher"
brew "fmt"
brew "fortune"
brew "fzf"
brew "gci"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "rebar3"
brew "gleam"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golines"
brew "gping"
brew "graphviz"
brew "grex"
brew "grpcurl"
brew "helix"
brew "hey"
brew "huggingface-cli"
brew "hyperfine"
brew "icu4c@77"
brew "jj"
brew "jq"
brew "kubectx"
brew "lazygit"
brew "libomp", link: true
brew "libressl"
brew "libsql"
brew "z3"
brew "llvm"
brew "lld"
brew "lld@20"
brew "lpeg"
brew "luacheck"
brew "luajit"
brew "luarocks"
brew "luv"
brew "make"
brew "miller"
brew "usage"
brew "mise"
brew "moor"
brew "nasm"
brew "unibilium"
brew "neovim"
brew "ninja"
brew "nmap"
brew "numpy"
brew "nushell"
brew "re2"
brew "onnxruntime"
brew "pgvector"
brew "pinentry-mac"
brew "pixi"
brew "pkgconf"
brew "pnpm"
brew "postgresql@17", restart_service: :changed, link: true
brew "prettier"
brew "procs"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "qt"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "sccache"
brew "sd"
brew "sevenzip"
brew "shfmt"
brew "solargraph"
brew "stern"
brew "tailspin"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "trufflehog"
brew "twine"
brew "uv"
brew "xh"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "nijaru/tap/bru"
brew "nijaru/tap/jb"
brew "nijaru/tap/sy", link: false
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"
cask "ableton-live-suite"
cask "alt-tab"
cask "antigravity"
cask "appcleaner"
cask "basictex"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "discord"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-ubuntu"
cask "gcloud-cli"
cask "google-chrome"
cask "iina"
cask "insta360-link-controller"
cask "linear-linear"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "obs"
cask "obs-backgroundremoval"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "orion"
cask "kushalpandya/tap/petrichor"
cask "qbittorrent"
cask "rekordbox"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "touchdesigner"
cask "transmission"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "xld"
cask "zed"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "ziglang.vscode-zig"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "ast-grep"
cargo "cargo-audit"
cargo "cargo-bloat"
cargo "cargo-deny"
cargo "cargo-fuzz"
cargo "cargo-generate"
cargo "cargo-llvm-cov"
cargo "cargo-tarpaulin"
cargo "flamegraph"
cargo "jb"
cargo "samply"
cargo "sqlx-cli"
cargo "stop-cli"
cargo "sy"
cargo "tree-sitter-cli"
