brew "age"
brew "ast-grep"
brew "atuin"
brew "bat"
brew "btop"
brew "chezmoi"
brew "ffmpeg"
brew "clang-format"
brew "coreutils"
brew "sqlite", link: true
brew "curl", link: true
brew "difftastic"
brew "direnv"
brew "dos2unix"
brew "duti"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golines"
brew "huggingface-cli"
brew "hyperfine"
brew "jj"
brew "jq"
brew "make"
brew "mas"
brew "mise"
brew "moor"
brew "neovim"
brew "nmap"
brew "oxfmt"
brew "oxlint"
brew "pinentry-mac"
brew "pixi"
brew "postgresql@17"
brew "prettier"
brew "ripgrep"
brew "ruff"
brew "sd"
brew "shfmt"
brew "tmux"
brew "tokei"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
# brew "nijaru/tap/jb"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "antigravity"
cask "appcleaner"
cask "basictex"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iina"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "obs"
cask "orbstack"
cask "kushalpandya/tap/petrichor"
cask "rectangle"
cask "spotify"
cask "unnaturalscrollwheels"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Tailscale", id: 1475387142
