tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "modularml/packages"
brew "age"
brew "zstd"
brew "webp"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "bandwhich"
brew "bat"
brew "biome"
brew "bottom"
brew "btop"
brew "sqlite"
brew "python@3.12"
brew "chezmoi"
brew "cmake"
brew "curl"
brew "direnv"
brew "doggo"
brew "duf"
brew "dust"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fcp"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grex"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jj"
brew "kubectx"
brew "lazygit"
brew "libsql"
brew "loc"
brew "luarocks"
brew "make"
brew "mise"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "pytorch"
brew "openai-whisper"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "prettier"
brew "procs"
brew "pyenv"
brew "python@3.11"
brew "rbenv"
brew "ripgrep"
brew "ruff"
brew "sd"
brew "shfmt"
brew "stern"
brew "tealdeer"
brew "tmux"
brew "topgrade"
brew "uv"
brew "wget"
brew "xh"
brew "yarn"
brew "yt-dlp"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
cask "ableton-live-suite"
cask "amethyst"
cask "appcleaner"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu"
cask "gitbutler"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "kitty"
cask "obs"
cask "obs-backgroundremoval"
cask "obsidian"
cask "ollama"
cask "orbstack"
cask "postgres-unofficial"
cask "qbittorrent"
cask "rectangle"
cask "slack"
cask "spotify"
cask "telegram"
cask "transmission"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "batisteo.vscode-django"
vscode "bbugh.change-color-format"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "ymotongpoo.licenser"
vscode "ziglang.vscode-zig"
