tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "modularml/packages"
tap "oven-sh/bun"
tap "sst/tap"
brew "age"
brew "zstd"
brew "sqlite"
brew "webp"
brew "python@3.12"
brew "aider"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "bat"
brew "biome"
brew "btop"
brew "ccache"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl"
brew "difftastic"
brew "direnv"
brew "doctl"
brew "doggo"
brew "dos2unix"
brew "duf"
brew "dust"
brew "envoy"
brew "exercism"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fcp"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gci"
brew "gh"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golines"
brew "graphviz"
brew "grex"
brew "grpc"
brew "grpcurl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jj"
brew "kubectx"
brew "lazygit"
brew "libressl"
brew "libsql"
brew "llvm"
brew "lld"
brew "loc"
brew "luarocks"
brew "make"
brew "mise"
brew "moar"
brew "nasm"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "nushell"
brew "pytorch"
brew "openai-whisper"
brew "pinentry-mac"
brew "pipx"
brew "pixi"
brew "pkgconf"
brew "pnpm"
brew "prettier"
brew "procs"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "python@3.11"
brew "ripgrep"
brew "ruff"
brew "scc"
brew "sd"
brew "shfmt"
brew "solargraph"
brew "starship"
brew "stern"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "uv"
brew "wget"
brew "xh"
brew "yarn"
brew "yt-dlp"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
cask "ableton-live-suite"
cask "alt-tab"
cask "appcleaner"
cask "battle-net"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-ubuntu"
cask "ghostty"
cask "gitbutler"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "monitorcontrol"
cask "mullvad-vpn"
cask "obs"
cask "obs-backgroundremoval"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "qbittorrent"
cask "rectangle"
cask "rekordbox"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zed"
cask "zed@preview"
cask "zoom"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "ziglang.vscode-zig"
